trunk/unmaintained/components/deployapi/test/org/smartfrog/services/deployapi/test/system/alpine/deployapi/files/getResourceProperties.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Header>
        <To xmlns:add="http://schemas.xmlsoap.org/ws/2003/03/addressing"
            xmlns="http://schemas.xmlsoap.org/ws/2003/03/addressing">http://localhost:8080/alpine/portal/
        </To>
        <Action xmlns:add="http://schemas.xmlsoap.org/ws/2003/03/addressing"
                xmlns="http://schemas.xmlsoap.org/ws/2003/03/addressing">
            http://www.gridforum.org/cddlm/deployapi/2005/02/wsdl/GetResourceProperty
        </Action>
    </Header>
    <Body>
        <GetResourceProperty
                xmlns:wsrf="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.xsd"
                xmlns:wsdm="http://docs.oasis-open.org/wsdm/2004/12/muws/wsdm-muws-part1.xsd"
                xmlns="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.xsd">
            wsdm:ResourceId
        </GetResourceProperty>
    </Body>
</Envelope>